Repository: PhuocDinh462/StudentHub
Catalog: lib/l10n/app_*.arb
Languages: vi

# language
source: {language, select, english{English} vietnamese{Vietnamese} other{Language}}
vi: {language, select, english{Tiếng Anh} vietnamese{Tiếng Việt} other{Ngôn ngữ}}

# theme
source: {theme, select, light{Light} dark{Dark} system{System} selectTheme{Select theme} other{Theme}}
vi: {theme, select, light{Sáng} dark{Tối} system{Hệ thống} selectTheme{Chọn giao diện} other{Giao diện}}

# account
source: {account, select, profiles{Profiles} settings{Settings} changePassword{Change password} logout{Logout} other{Account}}
vi: {account, select, profiles{Hồ sơ} settings{Cài đặt} changePassword{Đổi mật khẩu} logout{Đăng xuất} other{Tài khoản}}

# user
source: {user, select, student{Student} company{Company} other{User}}
vi: {user, select, student{Sinh viên} company{Công ty} other{Người dùng}}

source: Add profile
vi: Thêm hồ sơ

# logoutConfirm
source: Do you want to logout?
vi: Bạn có muốn đăng xuất?

# newType
source: New
vi: Mới

source: Working
vi: Thực hiện

source: Archived
vi: Lưu trữ

source: Projects
vi: Dự án

source: Dashboard
vi: Tổng quan

source: Messages
vi: Tin nhắn

source: Alerts
vi: Thông báo

source: Video call
vi: Gọi video

source: Settings
vi: Cài đặt

source: Post project
vi: Tạo dự án

source: Project detail
vi: Chi tiết dự án

source: Proposal detail
vi: Chi tiết đơn

source: Edit project
vi: Chỉnh sửa dự án

source: Profile
vi: Hồ sơ

source: No data available
vi: Không có dữ liệu

source: Yes
vi: Đồng ý

source: No
vi: Hủy

# postProjectStep1Title
source: Let's start with a strong title
vi: Chọn tiêu đề

# postProjectStep1Tip
source: This helps your post stand out to the right students. It's the first thing they'll see, so make it impressive!
vi: Một tiêu đề tốt sẽ giúp bạn thu hút sự chú ý của các ứng viên. Thế nên hãy chọn một tiêu đề mà bạn nghĩ sẽ thu hút họ nhất!

source: Enter your title
vi: Nhập tiêu đề

# blankInputTextError
source: Please enter some text
vi: Vui lòng nhập đầy đủ thông tin

# postProjectStep2Title
source: Next, estimate the scope of your project
vi: Tiếp theo, hãy xác định quy mô dự án của bạn

# postProjectStep2Scope
source: How long will your project take?
vi: Dự án của bạn sẽ diễn ra trong bao lâu?

# lessThanOneMonth
source: Less than 1 month
vi: Dưới 1 tháng

# postProjectStep2StudentRequire
source: How many students do you want for this project?
vi: Dự án của bạn cần bao nhiêu sinh viên?

# postProjectStep3Title
source: Next, provide project description
vi: Tiếp theo, hãy mô tả dự án của bạn

source: Describe your project
vi: Mô tả dự án của bạn

source: Description
vi: Mô tả

source: Project scope
vi: Thời lượng dự án

# studentRequire
source: Student required
vi: Số lượng sinh viên

source: students
vi: sinh viên

source: Educations
vi: Học vấn

source: Skills
vi: Kỹ năng

source: Resume
vi: Sơ yếu

source: Transcript
vi: Bảng điểm

# sendHiredOfferTitle
source: Hire offer
vi: Xác nhận ứng tuyển

# sendHireOfferContent
source: Do you really want to send hire offer for this student?
vi: Bạn có muốn gửi xác nhận ứng tuyển cho ứng viên này không?

# sendHireOfferFullStudentError
source: You have already hired enough students for this project
vi: Dự án này đã đạt số lượng sinh viên tối đa

# confirmationTitle
source: Confirmation
vi: Xác nhận

# confirmationContent
source: Are you sure to process?
vi: Bạn có chắc muốn thực hiện yêu cầu này không?

source: View
vi: Xem

source: View project
vi: Xem dự án

source: Edit
vi: Chỉnh sửa

# removeProjectTitle
source: Remove project
vi: Xóa dự án

# removeProjectContent
source: Do you really want to remove this project?
vi: Bạn có chắc muốn xóa dự án này không?

source: Remove
vi: Xóa

# startProjectTitle
source: Start project
vi: Bắt đầu dự án

# startProjectContent
source: Do you really want to start this project?
vi: Bạn có chắc muốn bắt đầu thực hiện dự án này không?

source: Start
vi: Bắt đầu

source: Start working this project
vi: Bắt đầu thực hiện dự án này

# startProjectErrorNotEnoughStudent
source: You need to hire enough students for this project to start
vi: Cần tuyển đủ sinh viên để bắt đầu dự án

# closeProjectTitle
source: Close project
vi: Đóng dự án

# closeProjectContent
source: Please choose your project status:
vi: Vui lòng chọn trạng thái cho dự án của bạn:

source: Close
vi: Đóng

source: Close this project
vi: Đóng dự án này

# optionsEmployees1
source: It's just me
vi: Chỉ mình tôi

# optionsEmployees2
source: 2-9 employees
vi: 2-9 nhân viên

# optionsEmployees3
source: 10-99 employees
vi: 10-99 nhân viên

# optionsEmployees4
source: 100-1000 employees
vi: 100-1000 nhân viên

# optionsEmployees5
source: More than 1000 employees
vi: Hơn 1000 nhân viên

# welcomeStudentHub
source: Welcome to Student Hub
vi: Chào mừng đến với Student Hub

# descriptionCompany
source: Tell us about your company and you will be on your way connect with high-skilled students.
vi: Hãy cho chúng tôi biết về công ty của bạn và bạn sẽ tiếp tục kết nối với những sinh viên có tay nghề cao.

# howManyPeople
source: How many people are in your company?
vi: Có bao nhiêu người trong công ty của bạn?

source: Company name
vi: Tên công ty

source: Your company
vi: Công ty của bạn

source: Your website
vi: Website của bạn

source: Your description
vi: Mô tả công ty

source: Continute
vi: Tiếp tục

source: Welcome,
vi: Xin chào,

# descriptionWelcomeCompany
source: Let's start with your first project post!
vi: Hãy bắt đầu với bài đăng dự án đầu tiên của bạn!

source: Getting started!
vi: Bắt đầu nào!

# descriptionStudent
source: Tell us about your-self and you will be on your way connect with real-world projects.
vi: Hãy cho chúng tôi biết về bản thân bạn và bạn sẽ tiếp tục kết nối với các dự án trong thế giới thực.

source: Next
vi: Tiếp theo

# languageP
source: Language
vi: Ngôn ngữ

# educaiion
source: Education
vi: Học vấn

# enterEducaiion
source: Enter your education
vi: Nhập học vấn của bạn

source: Year Start
vi: Năm bắt đầu

source: Year End
vi: Năm kết thúc

source: Techstack
vi: Công nghệ sử dụng

source: Skillset
vi: Kỹ năng

source: Select SkillSet
vi: Chọn kỹ năng

# experience
source: Experiences
vi: Kinh nghiệm

# addExperience
source: Add more to your experience
vi: Hãy thêm kinh nghiệm của bạn

source: Enter title project
vi: Nhập tiêu đề dự án

source: End
vi: Kết thúc

source: Enter description project
vi: Nhập mô tả dự án

source: Enter language
vi: Nhập ngôn ngữ

source: Native
vi: Bản địa

source: Billingual
vi: Song ngữ

# cVAndTranscript
source: CV & Transcript
vi: Sơ yếu lý lịch và bảng điểm

# cv
source: Resume/CV (*)
vi: Sơ yếu lý lịch (*)

# transcriptP
source: Transcript (*)
vi: Bảng điểm (*)

# yourProject
source: Your projects
vi: Dự án của bạn

# activeProposal
source: Active proposals
vi: Đề xuất đang hoạt động

# submitedProposal
source: Submitted proposals
vi: Đề xuất đã gửi

source: Submitted
vi: Đã gửi

source: Actived
vi: Hoạt động từ

# studentLooking
source: Students are looking for:
vi: Điều kiện đang tìm kiếm:

source: hours ago
vi: giờ trước

# mintesAgo
source: minutes ago
vi: phút trước

source: seconds ago
vi: giây trước

# emptyWorking
source: No project is working
vi: Không có dự án nào đang hoạt động

# emptyArchived
source: No project is archived
vi: Không có dự án nào đã lưu trữ

# notifSubmittedProposal
source: Your proposal has been submitted. Now you can update it.
vi: Đề xuất của bạn đã được gửi. Bây giờ bạn có thể cập nhật nó.

source: Cover letter
vi: Thư xin việc

# descriptionLetter
source: Describe why you fit into this project and what you can contribute to it.
vi: Mô tả lý do tại sao bạn phù hợp với dự án này và những gì bạn có thể đóng góp cho nó.

source: Your anwser
vi: Câu trả lời của bạn

source: Submit proposal
vi: Gửi đề xuất

source: Update proposal
vi: Cập nhật đề xuất

# errorTitle
source: Oh Hey!
vi: Lỗi!

# sucessTitle
source: Sucess
vi: Thành công

# errorFilledContent
source: Please fill in all fields
vi: Vui lòng điền đầy đủ thông tin

# sucessAccountContent
source: Create account successfully
vi: Email xác nhận đã được gửi đến Gmail. Xác nhận để kích hoạt tài khoản của bạn!

# errorAccountContent
source: Failed to create account
vi: Tạo tài khoản thất bại

# errorOccuredContent
source: An error occurred during sign up
vi: Đã xảy ra lỗi trong quá trình đăng ký

# signUpCompany
source: Sign Up As Company
vi: Đăng ký Công Ty

source: Fullname
vi: Họ và Tên

# inputEmailText
source: Work Email Address
vi: Địa chỉ Email

# inputPasswordText
source: Password
vi: Mật khẩu

# agreePolicy
source: Yes, I agree to all policies
vi: Đồng ý các điều khoản

source: Create Account
vi: Tạo Tài Khoản

# lookingProject
source: Looking for a project ?
vi: Đang tìm kiếm dự án?

source: Apply as student
vi: Đăng ký làm sinh viên

# signUpStudent
source: Sign Up As Student
vi: Đăng ký Sinh Viên

source: Apply as company
vi: Đăng ký công ty

# sucessSentPassword
source: New Password has sent to your email
vi: Mật khẩu mới đã được gửi đến email của bạn

source: Not Found User
vi: Không Tìm Thấy Người Dùng

source: Invalid Credentials
vi: Thông Tin Đăng Nhập Không Hợp Lệ

# somethingWrongs
source: Something went wrong!
vi: Đã Xảy Ra Lỗi!

source: Forgot Password?
vi: Quên Mật Khẩu?

# titleForgotPassword
source: Don't worry about your account
vi: Đừng lo lắng về tài khoản của bạn

# contentForgotPassword
source: Enter to send new password to your email
vi: Nhập để gửi mật khẩu mới đến email của bạn

# emailInputHint
source: Email Address
vi: Địa chỉ email

# newPassSent
source: New Password will be sent
vi: Mật khẩu mới sẽ gửi

# lessThanMin
source: less than a minute
vi: ít hơn một phút

source: Send Code
vi: Gửi Mã

source: Sign in successfully
vi: Đăng nhập thành công

source: Welcome Back!
vi: Chào mừng trở lại!

# loginToContinue
source: Please login to continue
vi: Vui lòng đăng nhập để tiếp tục

source: Login
vi: Đăng nhập

# dontHaveAccount
source: Don't have an Account?
vi: Chưa có tài khoản?

source: Sign up here
vi: Đăng ký ở đây

# joinAsRoles
source: Join as Company or Student
vi: Chọn Loại Tài Khoản Đăng Ký

# companyOption
source: I'm a Company, find engineer for project
vi: Tôi là một Công ty, tìm kỹ sư cho dự án

# studentOption
source: Student
vi: Sinh viên

# haveAccount
source: Already have an account ?
vi: Đã có tài khoản?

# noSavedProject
source: There's no saved projects available
vi: Không có dự án đã lưu nào có sẵn

# savedProject
source: Saved Projects
vi: Dự Án Đã Lưu

# filterProject
source: Filter Projects
vi: Lọc Dự Án

source: Cancel
vi: Hủy

# connectedMessage
source: You're connected on StudentHub
vi: Bạn đã kết nối trên StudentHub

# typeMessage
source: Type a message
vi: Nhập tin nhắn

source: Project Length
vi: Thời gian dự án

source: All
vi: Tất cả

# lessthanMonth
source: Less than one month
vi: Dưới một tháng

# oneToThreeMonths
source: 1 to 3 months
vi: 1 đến 3 tháng

# threeToSixMonths
source: 3 to 6 months
vi: 3 đến 6 tháng

# moreThanSixMonths
source: More than 6 months
vi: Hơn 6 tháng

# numberOfStudents
source: Enter Number of Students
vi: Nhập số lượng sinh viên

# proposalsLess
source: Proposals less than
vi: Đề xuất ít hơn

# numberOfProposals
source: Enter Number of Proposals
vi: Nhập số lượng đề xuất

source: Clear Filters
vi: Xóa bộ lọc

source: Apply
vi: Áp dụng

# errorFilledMeeting
source: Please fill all meeting's information
vi: Vui lòng điền đầy đủ thông tin cuộc họp

# scheduleInterview
source: Schedule a video call interview
vi: Lên lịch phỏng vấn

source: Title
vi: Tiêu đề

# titleHint
source: Enter meeting's title
vi: Nhập tiêu đề cuộc họp

source: Start Date
vi: Ngày bắt đầu

source: Start Time
vi: Giờ bắt đầu

source: End Date
vi: Ngày kết thúc

source: End Time
vi: Giờ kết thúc

source: Send Invite
vi: Gửi lời mời

source: Update
vi: Cập nhật

# wrongMeetingInfo
source: Wrong Meeting's information
vi: Thông tin cuộc họp không chính xác

source: Verify Meeting Room
vi: Xác minh Phòng Họp

# labelMeetingRoomId
source: Meeting Room ID
vi: ID Phòng Họp

# labelMeetingRoomCode
source: Meeting Room Code
vi: Mã Phòng Họp

source: Confirm
vi: Xác nhận

# reschedule
source: Re-Schedule the meeting
vi: Đặt lại lịch cuộc họp

source: Cancel the meeting
vi: Hủy cuộc họp

# canceledMeeting
source: The meeting has been canceled
vi: Cuộc họp đã bị hủy

# samePassword
source: Password and Confirm Password must be the same
vi: Mật khẩu và Xác nhận mật khẩu phải giống nhau

# changeSucess
source: Password changed successfully
vi: Đổi mật khẩu thành công

# failedChangePass
source: Failed to change password
vi: Không thể đổi mật khẩu

# changePasswordTitle
source: Change Your Password
vi: Thay Đổi Mật Khẩu Của Bạn

# oldPasswordHint
source: Enter your old password
vi: Nhập mật khẩu cũ của bạn

# newPassword
source: Enter new password
vi: Nhập mật khẩu mới

# confirmPassword
source: Confirm your Password
vi: Xác nhận mật khẩu của bạn

source: Change Password
vi: Đổi Mật Khẩu

# studentLookingFor
source: Student are looking for:
vi: Sinh viên đang tìm kiếm:

# student
source: students
vi: sinh viên

source: Apply Now
vi: Nộp đơn

source: View Letter
vi: Xem Thư

source: Save
vi: Lưu

# createStudentProfile
source: Please create your student's profile
vi: Vui lòng tạo hồ sơ sinh viên của bạn

# failedUpdateFavoriteProject
source: Failed to update favorite project
vi: Không thể cập nhật dự án yêu thích

source: Created
vi: Đã tạo

source: days ago
vi: ngày trước

source: Time
vi: Thời gian:

source: Proposals:
vi: Đề xuất:

source: Students Needed
vi: sinh viên

source: New messages
vi: Tin nhắn mới

source: New meeting
vi: Cuộc họp mới

source: New offer
vi: Đề nghị mới

source: New proposal
vi: Đề xuất mới

source: Successful hired
vi: Đã tuyển dụng thành công

source: sender
vi: người gửi

# notifInterview
source: You have a meeting titled
vi: Bạn có một cuộc họp với tiêu đề

source: from
vi: từ

source: at
vi: lúc

# notifOffer
source: You have a new offer from
vi: Bạn có một lời đề nghị từ

source: company
vi: công ty

# notifSumitted
source: has submitted a proposal for your project
vi: đã gửi đề xuất cho dự án của bạn

# notifHired
source: has been hired for the project
vi: đã được tuyển dụng cho dự án

# notifEmpty
source: No notifications
vi: Không có thông báo mới

source: No messages
vi: Không có tin nhắn mới

source: Interviews
vi: Phỏng vấn

# minutes
source: mins
vi: phút

source: Join
vi: Tham gia

# joinMeetingRoom
source: Join a meeting room
vi: Tham gia phòng họp

source: Meeting room ID
vi: ID phòng họp

source: Meeting room code
vi: Mật khẩu phòng họp

# joinMeetingRoomError
source: Not found meeting room
vi: Không tìm thấy phòng họp

source: Error
vi: Lỗi

source: Success
vi: Thành công

source: Fail
vi: Thất bại
